# Pandas

In [1]:
import numpy as np
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [5]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [15]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [14]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [20]:
SER1 = pd.Series(['USA','GERMANY','JAPAN'],[1,2,3])

In [22]:
SER2 = pd.Series(['USA','GERMANY','INDIA'],[1,2,4])

In [23]:
SER1+SER2

1            USAUSA
2    GERMANYGERMANY
3               NaN
4               NaN
dtype: object

In [27]:
SER3 = pd.Series([1,2,3],['USA','TERMANY','JAPAN'])
SER4 = pd.Series([1,2,4],['USA','TERMANY','INDIA'])
SER3+SER4

INDIA      NaN
JAPAN      NaN
TERMANY    4.0
USA        2.0
dtype: float64

# Data Frame 1

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [14]:
np.random.seed(101)

In [15]:
df = pd.DataFrame(randn(5,2),['A','B','C','D','E'],['W','X'])

In [20]:
df

          W         X
A  2.706850  0.628133
B  0.907969  0.503826
C  0.651118 -0.319318
D -0.848077  0.605965
E -2.018168  0.740122

# Data Frame 2

In [33]:
 df[(df['W']<0) | (df['X']>0)]

  index         W         X
0     A  2.706850  0.628133
1     B  0.907969  0.503826
3     D -0.848077  0.605965
4     E -2.018168  0.740122

In [35]:
df.reset_index(inplace=False)

   level_0 index         W         X
0        0     A  2.706850  0.628133
1        1     B  0.907969  0.503826
2        2     C  0.651118 -0.319318
3        3     D -0.848077  0.605965
4        4     E -2.018168  0.740122

In [36]:
df

  index         W         X
0     A  2.706850  0.628133
1     B  0.907969  0.503826
2     C  0.651118 -0.319318
3     D -0.848077  0.605965
4     E -2.018168  0.740122

In [39]:
newind = 'CA NY WY OP CO'.split()

In [40]:
newind

['CA', 'NY', 'WY', 'OP', 'CO']

In [41]:
df['States'] = newind

In [42]:
df

  index         W         X States
0     A  2.706850  0.628133     CA
1     B  0.907969  0.503826     NY
2     C  0.651118 -0.319318     WY
3     D -0.848077  0.605965     OP
4     E -2.018168  0.740122     CO

In [43]:
df.set_index('States')

       index         W         X
States
CA         A  2.706850  0.628133
NY         B  0.907969  0.503826
WY         C  0.651118 -0.319318
OP         D -0.848077  0.605965
CO         E -2.018168  0.740122

In [45]:
df.reset_index()

   level_0 index         W         X States
0        0     A  2.706850  0.628133     CA
1        1     B  0.907969  0.503826     NY
2        2     C  0.651118 -0.319318     WY
3        3     D -0.848077  0.605965     OP
4        4     E -2.018168  0.740122     CO

In [46]:
df

  index         W         X States
0     A  2.706850  0.628133     CA
1     B  0.907969  0.503826     NY
2     C  0.651118 -0.319318     WY
3     D -0.848077  0.605965     OP
4     E -2.018168  0.740122     CO